/*
  FILE: ss_create.sql
  รันไฟล์นี้เป็นไฟล์ที่สองเพื่อ INSERT ข้อมูล
*/

-- สลับไปใช้ Database 'myDB1' อีกครั้ง (เพื่อความแน่นอน)
USE myDB1;

-- ใส่ข้อมูล (ลบ GO ออก)
IF (SELECT COUNT(*) FROM dbo.courses_N) = 0
BEGIN
	INSERT INTO myDB1.dbo.courses_N (course_code,course_detail,course_group,course_name,credit,course_permission,course_next) VALUES
	 (N'คพ.111',N'พัฒนาทักษะการวิเคราะห์และการแก้ปัญหาด้วยแนวคิดเชิงวัตถุ บูรณาการแนวคิด และแนวทางเชิงปฏิบัติที่ทันสมัยในวัฏจักรการพัฒนาซอฟต์แวร์ หลักการพื้นฐาน ในการเขียนโปรแกรมเชิงวัตถุตามที่วิเคราะห์และออกแบบไว้ แนวทางในการทบทวน ความสอดคล้องระหว่างแบบและซอร์สโค้ด',N'วิชาเฉพาะด้าน (บังคับร่วม)',N'แนวคิดเชิงวัตถุ (Object-Oriented Concepts)',3,N'เคยศึกษา คพ.102 หรือ เคยศึกษา คพ.103',N'คพ.216 คพ.261 คพ.262 คพ.299 คพ.310'),
	 (N'คพ.101',N'ตรรกศาสตร์เบื้องต้นและการประยุกต์ใช้ในวงจรดิจิทัลพื้นฐาน วิธีการพิสูจน์ เซต ฟังก์ชัน ความสัมพันธ์ พีชคณิตบูลีน พื้นฐานการนับ และ กราฟ โดยเน้นการประยุกต์ใช้ในด้านวิทยาการคอมพิวเตอร์',N'วิชาแกน',N'โครงสร้างแบบไม่ต่อเนื่อง (Discrete Structures)',3,N'ไม่มีวิชาบังคับก่อน',N'คพ.233'),
	 (N'คพ.216',N'การวิเคราะห์เวลาดำเนินงานและความซับซ้อนของขั้นตอนวิธี โครงสร้างข้อมูลแบบต่าง ๆ อาร์เรย์ ลิงค์ลิสต์ สแตค คิว ทรี แฮช กราฟ ไบนารีฮีป การวิเคราะห์ความต้องการด้านเวลา และ หน่วยความจำในการค้นหา ขั้นตอนวิธีเกี่ยวกับการค้นหา และการเรียงลำดับ การแก้ปัญหาแบบบรูทฟอร์ซ การแบ่งแล้วเข้าตี ขั้นตอนวิธีการแบบละโมบ การชดเชยกันระหว่างเวลากับเนื้อที่ของการคำนวณ',N'บังคับเอก',N'โครงสร้างข้อมูลและขั้นตอนวิธี (Data Structures and Algorithms)',3,N'เคยศึกษา คพ.111',N'คพ.251 คพ.271'),
	 (N'คพ.233',N'สถาปัตยกรรมชุดคำสั่ง การประมวลผลแบบสายท่อ มัลติโพรเซสเซอร์ การจัดการหน่วยความจำ แคชและการจัดระบบหน่วยความจำเสมือน การประสานเวลาของโปรเซส การจัดตารางซีพียู มัลติเธรดดิง ระบบไฟล์ การควบคุมอินพุตเอาต์พุตและอุปกรณ์',N'วิชาเฉพาะด้าน (บังคับเอก)',N'สถาปัตยกรรมคอมพิวเตอร์และระบบปฏิบัติการ (Computer Architecture and Operating Systems)',3,N'เคยศึกษา คพ.101 หรือ คป.200',N'คพ.233'),
	 (N'คพ.240',N'หลักการพื้นฐานของวิทยาการข้อมูลที่เกี่ยวข้องกับอัลกอริทึม กระบวนการ วิธีการ และหลักการคิด รวมทั้งเครื่องมือที่ใช้ในการวิเคราะห์ข้อมูล หัวข้อพื้นฐานในวิทยาการข้อมูล ได้แก่ การจัดการข้อมูล การวิเคราะห์ข้อมูลเชิงสถิติ และเชิงการเรียนรู้ของเครื่องจักร การนำเสนอข้อมูลด้วยทัศนสารสนเทศและการทำงานกับข้อมูลขนาดใหญ่',N'วิชาเฉพาะด้าน (บังคับร่วม)',N'หลักการวิทยาการข้อมูล (Principles of Data Science)',3,N'เคยศึกษา คพ.101 หรือ คป.200',N'คพ.233'),
	 (N'คพ.102',N'การแก้ปัญหาด้วยวิธีการทางคอมพิวเตอร์ การออกแบบและการโปรแกรมเชิงโครงสร้าง ชนิดของข้อมูล โครงสร้างการควบคุม ฟังก์ชันและการส่งค่าพารามิเตอร์ ฟังก์ชันเวียนเกิด การทดสอบ และตรวจหาข้อผิดพลาด',N'วิชาเฉพาะด้าน (บังคับร่วม)',N'พื้นฐานการแก้ปัญหาและการโปรแกรมคอมพิวเตอร์ (Problem Solving Basics and Computer Programming)',3,N'เคยศึกษา คพ.101 หรือ คป.200',N'คพ.233');
END;

IF (SELECT COUNT(*) FROM dbo.courses_S) = 0
BEGIN
	INSERT INTO myDB1.dbo.courses_S (course_code,course_detail,course_group,course_name,credit,course_permission,course_next) VALUES
	 (N'คพ.111',N'พัฒนาทักษะการวิเคราะห์และการแก้ปัญหาด้วยแนวคิดเชิงวัตถุ บูรณาการแนวคิด และแนวทางเชิงปฏิบัติที่ทันสมัยในวัฏจักรการพัฒนาซอฟต์แวร์ หลักการพื้นฐาน ในการเขียนโปรแกรมเชิงวัตถุตามที่วิเคราะห์และออกแบบไว้ แนวทางในการทบทวน ความสอดคล้องระหว่างแบบและซอร์สโค้ด',N'วิชาเฉพาะด้าน (บังคับร่วม)',N'แนวคิดเชิงวัตถุ (Object-Oriented Concepts)',3,N'เคยศึกษา คพ.102 หรือ เคยศึกษา คพ.103',N'คพ.216 คพ.261 คพ.262 คพ.299 คพ.310'),
	 (N'คพ.101',N'ตรรกศาสตร์เบื้องต้นและการประยุกต์ใช้ในวงจรดิจิทัลพื้นฐาน วิธีการพิสูจน์ เซต ฟังก์ชัน ความสัมพันธ์ พีชคณิตบูลีน พื้นฐานการนับ และ กราฟ โดยเน้นการประยุกต์ใช้ในด้านวิทยาการคอมพิวเตอร์',N'วิชาแกน',N'โครงสร้างแบบไม่ต่อเนื่อง (Discrete Structures)',3,N'ไม่มีวิชาบังคับก่อน',N'คพ.233'),
	 (N'คพ.216',N'การวิเคราะห์เวลาดำเนินงานและความซับซ้อนของขั้นตอนวิธี โครงสร้างข้อมูลแบบต่าง ๆ อาร์เรย์ ลิงค์ลิสต์ สแตค คิว ทรี แฮช กราฟ ไบนารีฮีป การวิเคราะห์ความต้องการด้านเวลา และ หน่วยความจำในการค้นหา ขั้นตอนวิธีเกี่ยวกับการค้นหา และการเรียงลำดับ การแก้ปัญหาแบบบรูทฟอร์ซ การแบ่งแล้วเข้าตี ขั้นตอนวิธีการแบบละโมบ การชดเชยกันระหว่างเวลากับเนื้อที่ของการคำนวณ',N'บังคับเอก',N'โครงสร้างข้อมูลและขั้นตอนวิธี (Data Structures and Algorithms)',3,N'เคยศึกษา คพ.111',N'คพ.251 คพ.271'),
	 (N'คพ.233',N'สถาปัตยกรรมชุดคำสั่ง การประมวลผลแบบสายท่อ มัลติโพรเซสเซอร์ การจัดการหน่วยความจำ แคชและการจัดระบบหน่วยความจำเสมือน การประสานเวลาของโปรเซส การจัดตารางซีพียู มัลติเธรดดิง ระบบไฟล์ การควบคุมอินพุตเอาต์พุตและอุปกรณ์',N'วิชาเฉพาะด้าน (บังคับเอก)',N'สถาปัตยกรรมคอมพิวเตอร์และระบบปฏิบัติการ (Computer Architecture and Operating Systems)',3,N'เคยศึกษา คพ.101 หรือ คป.200',N'คพ.233'),
	 (N'คพ.240',N'หลักการพื้นฐานของวิทยาการข้อมูลที่เกี่ยวข้องกับอัลกอริทึม กระบวนการ วิธีการ และหลักการคิด รวมทั้งเครื่องมือที่ใช้ในการวิเคราะห์ข้อมูล หัวข้อพื้นฐานในวิทยาการข้อมูล ได้แก่ การจัดการข้อมูล การวิเคราะห์ข้อมูลเชิงสถิติ และเชิงการเรียนรู้ของเครื่องจักร การนำเสนอข้อมูลด้วยทัศนสารสนเทศและการทำงานกับข้อมูลขนาดใหญ่',N'วิชาเฉพาะด้าน (บังคับร่วม)',N'หลักการวิทยาการข้อมูล (Principles of Data Science)',3,N'เคยศึกษา คพ.101 หรือ คป.200',N'คพ.233'),
	 (N'คพ.102',N'การแก้ปัญหาด้วยวิธีการทางคอมพิวเตอร์ การออกแบบและการโปรแกรมเชิงโครงสร้าง ชนิดของข้อมูล โครงสร้างการควบคุม ฟังก์ชันและการส่งค่าพารามิเตอร์ ฟังก์ชันเวียนเกิด การทดสอบ และตรวจหาข้อผิดพลาด',N'วิชาเฉพาะด้าน (บังคับร่วม)',N'พื้นฐานการแก้ปัญหาและการโปรแกรมคอมพิวเตอร์ (Problem Solving Basics and Computer Programming)',3,N'เคยศึกษา คพ.101 หรือ คป.200',N'คพ.233');
END;

-- (ไม่ต้องมี GO)